{
  "backend/main.mo": "Motoko backend with access-controlled user profiles and an open contact inquiry submission system stored in memory.",
  "feature_evidence.json": "Feature evidence report mapping implemented frontend files to feature requirements and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global styles defining color variables and light/dark theming using OKLCH color values.",
  "frontend/index.html": "HTML entry point loading fonts and bootstrapping the React application.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all public site routes wrapped in the shared SiteLayout.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form component with validation, submission handling, and success/error messaging.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying college info, navigation links, contact details, and social media icons.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with logo, navigation links, and mobile slide-out menu using TanStack Router and UI components.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with a consistent layout including header, footer, and routed main content.",
  "frontend/src/data/newsEventsSeed.ts": "Defines news and event interfaces and provides hardcoded seed data for news items and upcoming events.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useSubmitInquiry.ts": "Provides a hook to submit inquiries through the backend actor with loading and error state management.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining color themes, typography, and utility classes.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero, history, mission, vision, and values sections using styled components.",
  "frontend/src/pages/AcademicsPage.tsx": "Displays a hero section and a grid of academic program cards grouped by category. Uses predefined program data with icons, descriptions, and degree lists.",
  "frontend/src/pages/AdmissionsPage.tsx": "Renders admissions hero content, application steps, deadlines, and requirements using cards and buttons. Includes links for applying and scheduling visits.",
  "frontend/src/pages/CampusLifePage.tsx": "Shows campus life categories in card format, each with descriptions and highlight lists. Includes a hero section introducing campus life content.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form and detailed contact information in cards, including address, phone, email, and office hours. Includes a hero section for the page.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, stats, featured programs, and media. Pulls in news and events data and uses cards, badges, and buttons for layout.",
  "frontend/src/pages/NewsEventsPage.tsx": "React page rendering news items and upcoming events using seed data with cards and a themed layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and container settings with plugins enabled.",
  "project_state.json": "Project state file defining current features, requirements, image needs, and metadata for the college website."
}